Repository: simongraeber/ai-quiz
Catalog: lib/l10n/app_*.arb
Languages: de

# language
source: English
de: Deutsch

# infoWelcomePage
source: Welcome to AI Quiz! In this exciting quiz Artificial Intelligence is used to ask you the best questions. On the next page you can create your team and start the game. As with other quizzes, you can choose categories but there is no pre-define here. Choose categories - anything from geography to kitchen appliances is possible! Based on your selection, the AI will ask you the perfect question. Have fun playing!
de: Herzlich willkommen beim AI-Quiz! In diesem aufregenden Quiz wird Künstliche Intelligenz verwendet, um Ihnen die besten Fragen zu stellen. Auf der nächsten Seite können Sie Ihr Team erstellen und das Spiel beginnen. Wie bei anderen Quizzen können Sie auch hier Kategorien wählen aber hier ist nicht vordefiniert. Wählen Sie Kategorien - von Erdkunde bis zu Küchengeräten ist alles möglich! Basierend auf Ihrer Auswahl wird die KI Ihnen die perfekte Frage stellen. Viel Spaß beim Spielen!

# aPIRequest
source: This quiz uses the OpenAI API. To use it, you need an API key. You can get it here:
de: Dieses Quiz benutzt die OpenAI API. Um diese zu nutzen, brauchst du einen API Key. Diesen kannst du hier bekommen:

# aPIKeyCheckError
source: An error occurred while checking the API key:
de: Beim Überprüfen des API Key ist ein Fehler aufgetreten:

# aPIKeyCheckErrorTip
source: Please check your API key and try again. If the error still occurs, you can see if there is a problem with the API here:
de: Bitte überprüfe deinen API Key und versuche es erneut. Wenn der Fehler weiterhin auftritt, kannst du hier sehn ob es ein Problem mit der API gibt:

# aPIKeyMissing
source: Please enter an API Key to start the quiz!
de: Bitte gib einen API Key ein, um das Quiz zu starten!

source: Start
de: Starten

# infoTeamPage
source: Welcome to the team page! Here you can create your teams for the upcoming AI quiz. Just press the "+" button to add a new team. If you want to delete a team, you can use the trash icon. When all teams are ready, you can start the quiz by clicking the "Start" button. Have fun with the quiz!
de: Willkommen zur Team-Seite! Hier können Sie Ihre Teams für das anstehende AI-Quiz erstellen. Drücken Sie einfach auf den "+"-Button, um ein neues Team hinzuzufügen. Wenn Sie ein Team löschen möchten, können Sie das Papierkorb-Symbol verwenden. Wenn alle Teams bereit sind, können Sie das Quiz starten, indem Sie auf den "Start"-Button klicken. Viel Spaß beim Quiz!

# noTeamAdded
source: You must add at least one team! Please add a team by clicking the "+" button.
de: Du musst mindestens ein Team hinzufügen! Drücke auf den "+"-Button, um ein neues Team hinzuzufügen.

# emptyTeamName
source: The team name must not be empty!
de: Der Teamname darf nicht leer sein!

source: Add team
de: Team hinzufügen

source: Correct!
de: Richtig!

# incorrect
source: Unfortunately wrong. The correct answer is:
de: Leider falsch. Die richtige Antwort ist:

source: No
de: Nein

# giveThePoints
source: Are you all agreed that the answer was correct and the points should be awarded?
de: Seid ihr euch alle einig dass die Antwort richtig war und die Punkte vergeben werden sollen?

# giveThePointsYes
source: Give points
de: Punkte geben

source: Cancel
de: Abbrechen

# questionError
source: An error occurred while loading the question:
de: Beim Laden der Frage ist ein Fehler aufgetreten:

# questionErrorTip
source: Das ist mir jetzt peinlich... Bitte w√§hlt erneut eine Kategorie aus.
de: Das ist mir jetzt peinlich... Bitte wählt erneut eine Kategorie aus.

# infoGamePage
source: Welcome, to the game page! Here the active team can choose a category and difficulty by clicking on "Choose category". The active team's card is larger than the other teams' card to highlight the active team. The team is free to choose a category - really anything goes! As soon as the team answers a question, its score is increased. The current round is displayed in the upper left corner. When all teams have answered a question, the round is increased. 'Via the "🏅"-symbol you will get to the ranking list. Good luck!
de: Willkommen, zur Spiel-Seite! Hier kann das aktive Team eine Kategorie und Schwierigkeit auswählen, indem es auf "Kategorie wählen" klickt. Die Karte des aktiven Teams ist größer als die Karten der anderen Teams, um das aktive Team hervorzuheben. Das Team kann eine Kategorie frei wählen - es ist wirklich alles möglich! Sobald das Team eine Frage beantwortet hat, wird seine Punktzahl erhöht. Die aktuelle Runde wird oben links angezeigt. Wenn alle Teams eine Frage beantwortet haben, wird die Runde erhöht. 'Über das "🏅"-Symbol gelangen Sie zur Rangliste. Viel Glück!

source: Choose category:
de: Kategorie wählen:

# chooseCategoryHint
source: Nature, sports, history, ...
de: Natur, Sport, Geschichte, ...

source: Choose difficulty:
de: Schwierigkeit wählen:

# chooseDifficultyEasy
source: Easy
de: Leicht

# chooseDifficultyMedium
source: Medium
de: Mittel

# chooseDifficultyHard
source: Hard
de: Schwer

# round
source: Round {round}
de: Runde {round}

# chooseCategoryButton
source: Choose category you can choose any category
de: Kategorie wählen

# categoryMustNotBeEmpty
source: The category must not be empty! Please choose any text as category.
de: Die Kategorie darf nicht leer sein! Bitte trage eine beliebige Kategorie ein.

# infoRankingPage
source: Congratulations for the award ceremony! Here you can see the placements of the teams based on their points, which are displayed in the table on the right side. After a while, a picture of the award ceremony will also be created, which you can download by clicking the download button. We hope you had fun and feel ready to play another round. When you are ready, you can reload the page in your browser. Thank you for playing!
de: Herzlichen Glückwunsch zur Siegerehrung! Hier werden die Platzierungen der Teams basierend auf ihren Punkten angezeigt, die in der Tabelle auf der rechten Seite angezeigt werden. Nach einer Weile wird auch ein Bild der Siegerehrung erstellt, das Sie über den Download-Button herunterladen können. Wir hoffen, dass Sie viel Spaß hatten und sich bereit fühlen, eine weitere Runde zu spielen. Wenn Sie bereit sind, können Sie die Seite in Ihrem Browser neu laden. Vielen Dank fürs Spielen!

# answerIndexOutOfBound
source: I guess something went wrong. None of the answers are marked as correct. 🙈
de: Da ist wohl etwas schief gelaufen. Keine der Antworten ist als richtig markiert. 🙈

# explainQuestionPotInstruction
source: You are an assistant who explains quiz questions. You explain why an answer is correct and why other answers can be excluded. You also explain some background information.
de: Du bist ein Assistent, der Quizfragen erklärt. Du erklärst, warum eine Antwort korrekt ist und warum andere Antworten ausgeschlossen werden können. Dabei erklärst du auch ein paar Hintergrundinformationen.

# explainQuestionUserMassage
source: Explain why "{getRealAnswer}" the correct answer to the question "{questionText}". Explain why {getWrongAnswers} are not correct answers.
de: Erkläre mir warum "{getRealAnswer}" die richtige Antwort auf die die Frage "{questionText}" ist. Erkläre Kurz warum {getWrongAnswers} keine richtigen Antwortmöglichkeiten sind.

# getQuestionPotInstruction
source: You are a quizmaster. You create questions for the selected category and a selected difficulty level. The difficulty is Easy, Medium or Hard. There is one correct answer and three unambiguously wrong answers.
de: Du bist ein Quizmaster. Du erstellst Fragen zu der ausgewählten Kategorie und einem ausgewählten Schwierigkeitslevel. Die Schwierigkeit ist Leicht, Mittel oder Schwer. Von den Antwortmöglichkeiten A1 bis A4 ist genau eine Antwort die richtig.

# getQuestionExample1UserMassage
source: Create a question: Category: Earth science Difficulty: Medium
de: Erstelle eine Frage: Category: Erdkunde Difficulty: Mittel

# getQuestionExample1BotMassage
source: Question: What is the capital of Morocco? Answer: Rabat WrongAnswers: 1: Berlin 2: Casablanca 3: Marrakesch
de: Question: Was ist die Hauptstadt von Marokko? Answer: Rabat Options: A1: Rabat A2: Berlin A3: Casablanca A4: Marrakech AnswerNr: A1

# getQuestionExample2UserMassage
source: Create a question: Category: Nature Difficulty: Hard
de: Erstelle eine Frage: Category: Natur Difficulty: Schwer

# getQuestionExample2BotMassage
source: Question: Which plant is a monocotyledon? Answer: Corn WrongAnswers: 1: Potato 2: pasture 3: Oak
de: Question: Welche Pflanze ist eine Monokotyledone? Answer: Mais Options: A1: Kartoffel A2: Weide A3: Eiche A4: Mais AnswerNr: A4

# getQuestionUserMassage
source: Create a question: Category: {category} Difficulty: {difficulty}
de: Erstelle eine Frage: Category: {category} Difficulty: {difficulty}
